[
  {
    "year": 2016,
    "day": 1,
    "problem_id": "P1",
    "topic": "Geometry",
    "statement": "Triangle BCF is right-angled at B. Point A is on line CF such that FA = FB and F lies between A and C. Point D is such that DA = DC and AC bisects ∠DAB. Point E is such that EA = ED and AD bisects ∠EAC. Let M be the midpoint of CF. Let X be the point such that AMXE is a parallelogram. Prove that lines BD, FX, and ME are concurrent.",
    "official_solution_available": true,
    "language": "en",
    "source": "IMO 2016 Day 1"
  },
  {
    "year": 2016,
    "day": 1,
    "problem_id": "P2",
    "topic": "Combinatorics",
    "statement": "Find all positive integers n for which an n×n table can be filled with letters I, M, O so that: (i) each row and column has one third of its entries I, one third M, one third O; (ii) in any diagonal with 3k entries, exactly k are I, k are M, k are O. (The table has 4n − 2 such diagonals.)",
    "official_solution_available": true,
    "language": "en",
    "source": "IMO 2016 Day 1"
  },
  {
    "year": 2016,
    "day": 2,
    "problem_id": "P3",
    "topic": "Number Theory",
    "statement": "Let P = n² + n + 1. Let S be a set of positive integers such that the set {P(a + 1), P(a + 2), ..., P(a + b)} is fragrant for every integer a ≥ 0. (A set is fragrant if each element has a prime factor not dividing any other element.) Find the least possible value of b.",
    "official_solution_available": true,
    "language": "en",
    "source": "IMO 2016 Day 2"
  },
  {
    "year": 2016,
    "day": 2,
    "problem_id": "P4",
    "topic": "Combinatorics",
    "statement": "A set of positive integers is fragrant if it contains at least two elements and each element has a prime factor not shared with any other element. Let P(n) = n² + n + 1. Find the least b such that there exists a non-negative integer a for which the set {P(a + 1), P(a + 2), ..., P(a + b)} is fragrant.",
    "official_solution_available": true,
    "language": "en",
    "source": "IMO 2016 Day 2"
  },
  {
    "year": 2016,
    "day": 2,
    "problem_id": "P5",
    "topic": "Geometry",
    "statement": "Given are n ≥ 2 lines in the plane, no two parallel, no three concurrent. A flea starts on a point of one line, can jump over the intersection of its current line with any other line, and never revisits any intersection. After n − 1 jumps it stops. Prove that: (a) for even n the flea can end on any line; (b) for odd n the flea can end on any line except the starting line.",
    "official_solution_available": true,
    "language": "en",
    "source": "IMO 2016 Day 2"
  },
  {
    "year": 2016,
    "day": 2,
    "problem_id": "P6",
    "topic": "Combinatorial Geometry",
    "statement": "There are n ≥ 2 line segments in the plane such that every two segments cross and no three segments meet at a single point. Geoff has to choose an endpoint of each segment and place a frog on it, facing the other endpoint. Then he simultaneously lets all frogs jump, each jumping over the other endpoint of its segment. The frogs never revisit an intersection. Prove that: (a) if n is even, Geoff can choose the starting points so that no two frogs ever occupy the same point; (b) if n is odd, such a choice is impossible.",
    "official_solution_available": true,
    "language": "en",
    "source": "IMO 2016 Day 2"
  }
]
